---
kind: enumMember
id: F:Autodesk.Revit.DB.PrintRange.Current
enum: Autodesk.Revit.DB.PrintRange
source: html/1f93dd2e-cf31-9990-cfa0-0100e523b843.htm
---
# Autodesk.Revit.DB.PrintRange.Current

A range that represents just the currently active view.